app/views/wants/_cheer.html.erb

SELECT COUNT(*) FROM "cheers" WHERE "cheers"."want_id" = ?  [["want_id", 4]]
---
<i class="fa fa-child" aria-hidden="true style="color:red;""></i>
      <%= want.cheers.count %>人が応援中

SELECT COUNT(*) FROM "cheers" WHERE "cheers"."want_id" = ?  [["want_id", 1]]
---
<i class="fa fa-child"  style="color:lightgray"></i>
    <%= want.cheers.count %>人が応援中