app/views/wants/edit.html.erb

SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 2]]
---
<h2>目標を変更する</h2>
<% @user.wants.each do |want| %>