app/views/wastes/edit.html.erb

<h2>無駄遣いを変更する</h2>
<% @user.wastes.each do |waste| %>
---
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 2]]