app/views/wastes/index.html.erb

SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 4]]
---
  </thead>
    <% @user.wastes.each do |waste| %>