app/views/users/_register.html.erb

                <td><% sum = 0 %>
                  <% user.wastes.each do |waste| %>
---
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 4]]

            <tbody>
              <% user.wants.each do |want| %>
---
SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 4]]