app/views/users/index.html.erb

    <tr>
     <% user.wants.each do |want| %>
---
SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 1]]


  <% user.wastes.each do |waste| %>
---
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 1]]