app/views/users/mypage.html.erb

    <tbody>
      <% @user.wastes.each do |waste| %>
---
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 1]]

            <tr>
              <% @user.wants.each do |want| %>
              <!-- <td>want.image 欲しいものの画像</td> -->
              <td><%= want.cheers.count %><i class="fa fa-child" aria-hidden="true" style="color:red;"></i></td>
---
SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "cheers" WHERE "cheers"."want_id" = ?  [["want_id", 1]]