app/views/users/mypage.html.erb

          <tr>
            <% @user.wants.each do |want| %>
            <td><%= want.cheers.count %><i class="fa fa-child" aria-hidden="true" style="color:red;"></i></td>
---
SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 7]]
SELECT COUNT(*) FROM "cheers" WHERE "cheers"."want_id" = ?  [["want_id", 9]]