app/controllers/cheers_controller.rb

SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cheers" ("user_id", "want_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["want_id", 1], ["created_at", "2020-09-05 07:32:39.855169"], ["updated_at", "2020-09-05 07:32:39.855169"]]
---
  def create
    @want = Want.find(params[:want_id])
    cheer = current_user.cheers.new(want_id: @want.id)
    cheer.save

SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cheers".* FROM "cheers" WHERE "cheers"."user_id" = ? AND "cheers"."want_id" = ? LIMIT ?  [["user_id", 2], ["want_id", 4], ["LIMIT", 1]]
DELETE FROM "cheers" WHERE "cheers"."id" = ?  [["id", 2]]
---
  def destroy
    @want = Want.find(params[:want_id])
    cheer = current_user.cheers.find_by(want_id: @want.id)
    cheer.destroy