app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:user_id])
    follow = current_user.active_relationships.build(follower_id: params[:user_id])
    respond_to do |format|
      follow.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "relationships" ("created_at", "updated_at", "following_id", "follower_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-09-05 11:44:41.654828"], ["updated_at", "2020-09-05 11:44:41.654828"], ["following_id", 2], ["follower_id", 1]]

  def destroy
    @user = User.find(params[:user_id])
    follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 3]]