app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]
---
  def index
  # ランダム表示
    if user_signed_in?
      @users = User.where.not(id: current_user.id).shuffle
      @users = User.page(params[:page]).per(6)
    else
      @users = User.all.shuffle

SELECT  "wastes".* FROM "wastes" WHERE "wastes"."waste_id" = ? LIMIT ?  [["waste_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def mypage
    @user = current_user
    @wastes = Waste.where(user_id: @user.id)

# 自分自身の無駄遣い削減合計
    @user_total_price = 0
    @wastes.each do |waste|
      waste_total = waste.price * waste.count
      @user_total_price+=waste_total
    end

# 現在の積みたて＝今使ってもいい額＝無駄遣い削減合計ー目標達成の購入額
    @user_difference_price = @user_total_price - @user.purchase_price
    @waste_count_all = 0
    @wastes.each do |waste|
      @waste_count_all += waste.count
    end

# 全ユーザーの無駄遣い削減額
    @user_all = User.all