app/controllers/users_controller.rb

UPDATE "users" SET "nickname" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nickname", "ほげhoge"], ["profile_image_id", "7a0ce325e0d019effddc5666b56d5063f7d76c57ccb535c8325163e92e2d"], ["updated_at", "2020-09-05 05:06:42.320994"], ["id", 2]]
---
  def update
    @user = current_user
    if @user.update(user_params)

SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 7]]
---
  def mypage
    @user = current_user
    @wastes = Waste.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def hide # 退会オプション、destroyにしないのは合計額が崩れるから
    @user = User.find(params[:id])