app/controllers/wants_controller.rb

  def index
    @user = current_user
    @want = Want.new
    @wants = current_user.wants.all
---
SELECT "wants".* FROM "wants" WHERE "wants"."user_id" = ?  [["user_id", 2]]

  def show
    @want = Want.find(params[:id])
---
SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @want = Want.new(want_params)
    @want.user_id = current_user.id
    if @want.save
---
INSERT INTO "wants" ("name", "price", "reason", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pixel"], ["price", 100000], ["reason", "携帯を買い換えたい"], ["created_at", "2020-09-02 02:15:33.497425"], ["updated_at", "2020-09-02 02:15:33.497425"], ["user_id", 2]]

  def purchase
    @user = current_user
    @want = Want.find(params[:want_id])
    @user.purchase_price = @user.purchase_price + @want.price
    @user.save
---
SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "purchase_price" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["purchase_price", 5000], ["updated_at", "2020-09-05 04:15:07.121505"], ["id", 2]]
UPDATE "wants" SET "reason" = ?, "updated_at" = ? WHERE "wants"."id" = ?  [["reason", "ああああああああ"], ["updated_at", "2020-09-03 11:32:27.318786"], ["id", 8]]

  def update
    @want = Want.find(params[:id])
    if @want.update(want_params)
---
SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "wants" SET "reason" = ?, "want_image_id" = ?, "updated_at" = ? WHERE "wants"."id" = ?  [["reason", "山が好き"], ["want_image_id", "c937d0f7c10294dd35df6d6b2f60cb9e115582a694589fdd4a2af8e17ad3"], ["updated_at", "2020-09-06 09:31:28.645412"], ["id", 1]]

  def destroy
    want = Want.find(params[:id])
    want.destroy
---
SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "wants" WHERE "wants"."id" = ?  [["id", 9]]

  def hide
    @want = Want.find(params[:id])
---
SELECT  "wants".* FROM "wants" WHERE "wants"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]