app/controllers/wastes_controller.rb

UPDATE "wastes" SET "reason" = ?, "updated_at" = ? WHERE "wastes"."id" = ?  [["reason", "飲み過ぎ/高い"], ["updated_at", "2020-09-06 11:49:09.138354"], ["id", 1]]
---
def update
  @waste = Waste.find(params[:id])
  if @waste.update(waste_params)