app/controllers/wastes_controller.rb

def create
  @waste = Waste.new(waste_params)
  @waste.user_id = current_user.id
  if @waste.save
---
INSERT INTO "wastes" ("name", "price", "reason", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "水"], ["price", 150], ["reason", "買わなくていい"], ["created_at", "2020-09-03 06:30:32.431265"], ["updated_at", "2020-09-03 06:30:32.431265"], ["user_id", 3]]

def count_up
  @waste = Waste.find(params[:waste])
  @waste.count = @waste.count + 1
  @waste.save
  flash.now[:gain] = "すばらしい！！"

  # 〜〜部分テンプレート用〜〜
  @user = current_user
  @wastes = Waste.where(user_id: @user.id)

  # 自分自身の無駄遣い削減合計
  @user_total_price = 0
  @wastes.each do |waste|
    waste_total = waste.price * waste.count
    @user_total_price+=waste_total
  end

  # 現在の積みたて＝今使ってもいい額＝無駄遣い削減合計ー目標達成の購入額
  @user_difference_price = @user_total_price - @user.purchase_price
  @waste_count_all = 0
  @wastes.each do |waste|
    @waste_count_all += waste.count
  end

  # 全ユーザーの無駄遣い削減額
  @user_all = User.all
  @users_wastes_all = 0
  @user_all.each do |user|
    user.wastes.each do |waste|
---
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "wastes" SET "count" = ?, "updated_at" = ? WHERE "wastes"."id" = ?  [["count", 1], ["updated_at", "2020-09-06 12:27:51.944590"], ["id", 9]]
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 2]]
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

def count_down
  @waste = Waste.find(params[:waste])
  @waste.count = @waste.count - 1
  @waste.save
  flash.now[:lose] = "今回はご褒美！"

  # 〜〜部分テンプレート用〜〜
  @user = current_user
  @wastes = Waste.where(user_id: @user.id)
---
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "wastes" SET "price" = ?, "reason" = ?, "updated_at" = ? WHERE "wastes"."id" = ?  [["price", 300000], ["reason", "女のくれてやる金はねぇ"], ["updated_at", "2020-09-06 09:49:00.092019"], ["id", 8]]
SELECT "wastes".* FROM "wastes" WHERE "wastes"."user_id" = ?  [["user_id", 2]]

def update
  @waste = Waste.find(params[:id])
  if @waste.update(waste_params)
---
SELECT  "wastes".* FROM "wastes" WHERE "wastes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "wastes" SET "price" = ?, "reason" = ?, "updated_at" = ? WHERE "wastes"."id" = ?  [["price", 300000], ["reason", "女のくれてやる金はねぇ"], ["updated_at", "2020-09-06 09:49:00.092019"], ["id", 8]]